softrider70/lora/sdkconfig.defaults
# Heltec WiFi LoRa 32 V3 (ESP32-S3 + SX1262 + OLED SSD1306)
# Basis: sdkconfig.defaults aus katzenbrunnen + Anpassungen fuer V3

CONFIG_IDF_TARGET="esp32s3"

# ESP32-S3 Dual-Core
CONFIG_FREERTOS_UNICORE=n

# PSRAM (8MB Octal/OPI)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
# CONFIG_SPIRAM_MEMTEST is not set
CONFIG_SPIRAM_IGNORE_NOTFOUND=y

# CPU Takt
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_240=y

# Flash: 16MB Quad-Flash
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# Eigene Partitionstabelle (OTA-Layout)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Console: USB Serial/JTAG (Heltec V3 hat nativen USB-C)
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
# CONFIG_ESP_CONSOLE_UART_DEFAULT is not set

# Watchdog
CONFIG_ESP_TASK_WDT=y
CONFIG_ESP_TASK_WDT_PANIC=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10

# FreeRTOS
CONFIG_FREERTOS_HZ=100
CONFIG_FREERTOS_IDLE_TASK_STACKSIZE=1536

# Enable HTTP server (fuer OTA-WebUI)
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512
CONFIG_HTTPD_QUEUE_DEPTH=10

# OTA
CONFIG_ESP_HTTPS_OTA_ALLOW_HTTP=y
CONFIG_ESP_HTTPS_OTA_DECRYPT_CALLBACK=y

# Logging
CONFIG_LOG_DEFAULT_LEVEL_VERBOSE=y
CONFIG_LOG_MAXIMUM_LEVEL=5

# LWIP
CONFIG_LWIP_DNS_SUPPORT_MDNS_QUERIES=y

# mDNS
CONFIG_MDNS_ENABLE_NETWORKING=y

# NVS
CONFIG_NVS_ENCRYPTION=n